<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>DNSSettings</key>
                <dict>
                    <key>DNSProtocol</key>
                    <string>TLS</string>
                    <key>ServerAddresses</key>
                    <array>
                        <string>2400:3200::1</string>
                        <string>2400:3200:baba::1</string>
                        <string>223.5.5.5</string>
                        <string>223.6.6.6</string>
                    </array>
                    <key>ServerName</key>
                    <string>dns.alidns.com</string>
                </dict>
                <key>PayloadDescription</key>
                <string>Configures device to use AliDNS Encrypted DNS over TLS</string>
                <key>PayloadDisplayName</key>
                <string>AliDNS DNS over TLS</string>
                <key>PayloadIdentifier</key>
                <string>com.apple.dnsSettings.managed.9d6e5fdf-e404-4f34-ae94-27ed2f636ac4</string>
                <key>PayloadType</key>
                <string>com.apple.dnsSettings.managed</string>
                <key>PayloadUUID</key>
                <string>35d5c8a0-afa6-4b36-a9fe-099a997b44ad</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>ProhibitDisablement</key>
                <false/>
            </dict>
        </array>
        <key>PayloadDescription</key>
        <string>Adds the AliDNS to Big Sur and iOS 14 based systems</string>
        <key>PayloadDisplayName</key>
        <string>AliDNS over TLS</string>
        <key>PayloadIdentifier</key>
        <string>com.paulmillr.apple-dns</string>
        <key>PayloadRemovalDisallowed</key>
        <false/>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>6C7F342C-930C-49D7-8FFF-750F38CE39DD</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
    </dict>
</plist>
